// @ts-nocheck
import CloseModalButton from '../../../contexts/components/CloseModalButton';
import { useModal } from '../../../contexts/ModalContext';

function MembershipModal() {

    const { closeModal } = useModal();

    return (
        <div className='membership-agreement-box'>
            <CloseModalButton closeModal={closeModal} />
            <h1>قرارداد عضویت</h1>
            <div className='membership-terms-box'>
                <h4>۱. هدف قرارداد</h4>
                <p><strong>۱.۱.</strong> این قرارداد به منظور تعیین شرایط استفاده از برنامه چت بلادرنگ ChatNest و حقوق و تعهدات عضو تنظیم شده است.</p>
                <p><strong>۱.۲.</strong> ChatNest هیچ هدف تجاری ندارد و تنها یک پروژه آموزشی و درسی تهیه شده در چارچوب درس شبکه های کامپیوتری است. این برنامه به منظور شبیه سازی یک پلتفرم چت واقعی طراحی شده است.</p>

                <h4>۲. شرایط عضویت</h4>
                <p><strong>۲.۱.</strong> با درخواست عضویت، عضو اعلام می‌کند که این قرارداد را خوانده، درک کرده و تمام شرایط آن را پذیرفته است.</p>
                <p><strong>۲.۲.</strong> درخواست عضویت با تکمیل کامل و صحیح اطلاعات لازم توسط عضو و تایید صاحب پروژه انجام می‌شود. صاحب پروژه حق رد درخواست های عضویت را محفوظ می‌دارد.</p>

                <h4>۳. شرایط و محدودیت های استفاده</h4>
                <p><strong>۳.۱.</strong> عضو می‌پذیرد که برنامه ChatNest را تنها برای استفاده شخصی استفاده کند. تمام عملیات در برنامه (ارسال پیام، ایجاد اتاق چت و غیره) کاملاً برای اهداف شبیه سازی است و ماهیت تجاری واقعی ندارد.</p>
                <p><strong>۳.۲.</strong> عضو می‌پذیرد که تمام محتوا و عملیات در برنامه واقعی نیست و تنها برای اهداف آموزشی و توسعه پروژه ارائه می‌شود.</p>

                <h4>۴. حریم خصوصی</h4>
                <p><strong>۴.۱.</strong> صاحب پروژه متعهد می‌شود که اطلاعات شخصی عضو را با هیچ شخص ثالثی به اشتراک نگذارد.</p>
                <p><strong>۴.۲.</strong> عضو مسئول امنیت اطلاعاتی مانند رمز عبور و نام کاربری که برای دسترسی به برنامه استفاده می‌کند، می‌باشد. عضو مسئول خسارات ناشی از استفاده غیرمجاز این اطلاعات توسط اشخاص غیرمجاز است.</p>

                <h4>۵. استفاده و امنیت داده ها</h4>
                <p><strong>۵.۱.</strong> تمام اطلاعات ارائه شده توسط عضو تنها برای اهداف شبیه سازی استفاده خواهد شد و هیچ گاه برای اهداف تجاری یا شخص ثالث پردازش نخواهد شد.</p>
                <p><strong>۵.۲.</strong> تمام عملیات عضو در برنامه (ارسال پیام، ایجاد اتاق چت و غیره) مانند یک تراکنش تجاری واقعی پردازش نخواهد شد، بلکه تنها در چارچوب شبیه سازی ارزیابی خواهد شد.</p>

                <h4>۶. سلب مسئولیت</h4>
                <p><strong>۶.۱.</strong> صاحب پروژه اعلام می‌کند که محتوا و عملیات در برنامه واقعیت ندارند و تنها برای اهداف آموزشی و توسعه هستند. عضو این وضعیت را می‌پذیرد و برنامه را با این آگاهی استفاده می‌کند.</p>
                <p><strong>۶.۲.</strong> عضو می‌پذیرد که صاحب پروژه را مسئول هیچ گونه خساراتی که ممکن است در طول استفاده از برنامه رخ دهد، نمی‌داند.</p>
            </div>
        </div>
    );
}

export default MembershipModal;